app/views/posts/index.html.erb

        <td><%= post.user.name %></td>
        <td><%= post.comments.count %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]